#Задача 2
#У вхідному рядку записана послідовність чисел через пробіл.
# Для кожного числа виведіть слово YES (в окремому рядку), якщо це
# число раніше зустрічалося в послідовності або NO, якщо не зустрічалося.
dig=list(map(int,input("Введите последовательность чисел").split(' ')))
mnoz = set()
print(mnoz)
print(dig)
for i in dig:
    if i in mnoz:
        print(str(i)+': YES')
    else:
        print(str(i) + ': NO')
        mnoz.add(i)
